Repository: litgame/single_player_app
Catalog: lib/src/localization/app_*.arb
Languages: ru

# appTitle
source: Litgame
ru: Литигра

# settingsTitle
source: Settings
ru: Настройки

# settingsThemeTitle
source: Select theme
ru: Тема приложения

# settingsThemeSystem
source: System Theme
ru: Системная тема

# settingsThemeDark
source: Dark Theme
ru: Тёмная тема

# settingsThemeLight
source: Light Theme
ru: Светлая тема

# settingsCollectionTitle
source: Select default collection
ru: Коллекция карт для игры

# settingsCollectionNone
source: Not selected
ru: Не выбрана

# settingsWithMagic
source: Game with magic
ru: Использовать карты магии

# settingsVibrationOn
source: Vibration On
ru: Включить вибрацию

# settingsSoundOn
source: Sound On
ru: Включить звук

# scDownload
source: Download
ru: Скачать

# scDownloadProgress
source: Downloading...
ru: Скачиваем...

# scDownloadFinished
source: Stored offline!
ru: Скачано!

# scDelete
source: Delete
ru: Удалить

# scNoNetwork
source: No network
ru: Нет сети!

# scNoNetworkNewGame
source: To play game you need to enable network or download cards offline
ru: Чтобы играть, нужен либо интернет, либо скачанные локально карты (см. настройки)

# mainTitle
source: Litgame
ru: Литигра

# mainStart
source: Start new game
ru: Начать новую игру

# mainSettings
source: Settings
ru: Настройки

# mainExit
source: Exit
ru: Выйти

# gameTitle
source: Lit Game
ru: Литигра

# gameOkButton
source: Ok
ru: Я поняль

# gameTitleDocAll
source: About game
ru: Главное об игре

# gameTitleDocAllShow
source: Show 'About game' screen?
ru: Показывать справку 'Главное об игре'?

# gameTitleDocTraining
source: About training
ru: Что такое разминка?

# gameTitleDocTrainingShow
source: Show 'About training' screen?
ru: Показывать справку 'Что такое разминка'?

# gameTitleTraining
source: Training
ru: Разминка

# gameTitleTrainingFinish
source: Finish training
ru: Завершить разминку

# gameTitleDocGame
source: About game stage
ru: Как играть в игру?

# gameTitleDocGameShow
source: Show 'About game' last screen?
ru: Показывать справку 'Как играть в игру'?

# gameTitleGame
source: Game
ru: Игра

# gameFinish
source: Finish the game
ru: Завершить игру

# gameFinishConfirmTitle
source: Really finish the game?
ru: Правда закончить игру?

# gameFinishConfirmDescription
source: All progress and magic (if any) will be lost!
ru: Вся магия (если была) будет утеряна, карты перемешаны заново!

# gameFinishConfirmYes
source: Yes, finish!
ru: Да, заканчиваем!

# gameFinishConfirmNo
source: No, keep playing!
ru: Нет, ещё поиграем!

# gameNextTurn
source: Next turn
ru: Следующий ход

# pageNotFoundTitle
source: Page not found!
ru: Нет такой страницы!

# cardTypeGeneric
source: Generic
ru: Общая

# cardTypePerson
source: Person
ru: Персонаж

# cardTypePlace
source: Place
ru: Место

# magicSettingsTitle
source: Magic settings
ru: Настройки карт магии

# magicSettingsPlayersCount
source: How many players (approximately) will play the game?
ru: Сколько игроков (примерно) будет играть в игру?

# magicStartFromCycle
source: Start magic from cycle:
ru: Выдавать карты магии с круга игры:

source: Magic probability
ru: Вероятность появления карты магии

# magicPlayButton
source: Play!
ru: Играть!

# magicModalTitle
source: Magic:
ru: Заклинание:

# magicModalSave
source: Save
ru: Заколдовать!

# magicModalTurns
source: Apply magic after N turns:
ru: Через сколько ходов применить магию?

# magicModalTurnsEurythmics
source: Every N turns the word (phrase) should be used:
ru: Каждые N ходов слово или фраза должны быть использованы игроком

# magicDescriptionAbstract
source: Selected phrase
ru: Выбранная фраза:

# magicMarionetteTitle
source: Marionette
ru: Марионетка

# magicKeywordTitle
source: Keyword
ru: Ключевое слово

# magicEurythmicsTitle
source: Eurythmics
ru: Ритмика

# magicCancelTitle
source: Cancel magic
ru: Отмена магии

# magicAdditionalEventTitle
source: Additional event
ru: Дополнительное событие

# magicMarionetteDescription
source: Now you can specify, what events should happen after specified number of turns.
ru: Это возможность решить, что должно произойти в игровом мире через заданное количество ходов. Игрок, в чей ход сработает магия, должен будет участь оставленное здесь сообщение и вплести его в свой рассказ.

# magicMarionetteViewDescription
source: Somebody already decided, what shoult to happen at this turn. Now, try to interweave this event into you story:
ru: Кто-то за вас решил, что должно свершиться в этот ход. Попробуйте теперь вплести это событие в свою историю:

# magicMarionetteText
source: What should to happen at that turn?
ru: Что должно произойти в этот ход?

# magicEurythmicsDescription
source: Funny magic. You magic forces all players to use specified word or phrase every N turns. Works till the end of game but can be cancelled by another magic.
ru: Ритмика. Забавное такое заклинание... Каждые N ходов, начиная с Заколдованного, игрок должен использовать в рассказе слово или фразу, заданную Магом.

# magicEurythmicsText
source: Word or phrase
ru: Слово или фраза, которую будут называть игроки

# magicEurythmicsViewText
source: At this turn you should use the phrase «{phrase}»
ru: Нужно использовать в своём рассказе слово / фразу «{phrase}»

# magicKeywordDescription
source: Evil magic. Spellbound player must use N times a word or phrase, specified my mage.
ru: Ключевое слово: Заколдованный должен N раз использоватьв своём рассказе слово или фразу, заданную Магом. Черная, злая магия!..

# magicKeywordViewDescription
source: At this turn you should repeat the phrase «{phrase}» {count} times
ru: В этот ход вы должны повторить {count} раз слово / фразу «{phrase}»

# magicKeywordText
source: The word or phrase to be repeated
ru: Ключевое слово, которое придётся повторять:

# magicKeywordRepeats
source: Count of repeats
ru: Сколько раз повторить ключевое слово:

# magicAdditionalEventDescription
source: After N turns target player will be forced to get an additional event
ru: Через указанное количество ходов игроку выпадет дополнительная карта событий

# magicAdditionalEventFire
source: You have additional event card!
ru: Вам выпала дополнительная карта события!

# magicCancelDescription
source: Now you can cancel one magic, applied to the game
ru: Уникальная возможность отменить одно из магических воздействий, наложенных ранее на игру

# magicAlertTitle
source: Magic failed
ru: Заклинание сорвалось!

# magicAlertUnknown
source: Unknown error, report a bug, please
ru: Неизвестная ошибка, сообщите разработчику, пожалуйста

# magicAlertDescriptionMarionette
source: Description should be filled. In description you should explain, what event should happen at specified turn
ru: Поле с описанием должно быть заполнено. Опишите подробно (или не очень), что должно произойти на указанном ходе, какие события должны случиться в мире / с персонажами и т.п... Другой игрок должен будет подстроить сво рассказ под эти указания

# magicAlertDescriptionEurythmics
source: Eurythmics phrase (one or multiple words) should be specified
ru: Нужно указать фразу "ритмики": одно или несколько слов

# magicAlertDescriptionKeyword
source: Keyword should be specified
ru: Нужно указать ключевое слово!

# magicAlertTurn
source: Turn number should be greater than 0. Report a bug, please
ru: Нельзя применить магию через 0 ходов. Странно, что эта ошибка вообще произошло. Сообщите разработчику, плиз.

# magicDelete
source: Delete magic?
ru: Удалить?

# magicDeleteDescription
source: You can delete only one item!
ru: Можно удалить только одно заклятие!

# magicModalViewTitle
source: Magic at you turn:
ru: Твой ход заколдован!

# docAllScreen
source: __The essence and task of the game__ is to compose an arbitrary story on a specific topic together with friends. And, of course, enjoy both the process and the result :-) __ Rules of the game: __ - Players take turns. Each player draws a card from one of the three decks to choose from on his turn and tells his part of the story, guided by the card that fell to him. - During the player's turn, no one has the right to correct or interrupt him, he is completely free to interpret the meaning of the card and compose his part of the story, although he must rely on common sense, the plot told earlier and general agreements. - Before starting the game, it is recommended to jointly decide which genre, style and universe the narrative will relate to. __ Types of cards.__ There are three types of cards in the game: - Location - assumes that the action of the plot should be transferred to the place indicated on the map (literally or figuratively) - The character - the player who drew this card must introduce the character (literally or figuratively) indicated on the map into the narrative. - General - these cards set the theme for all other events/phenomena that should occur in the game world during the course of the player who drew them. BUT don't take it too seriously! Remember - it's just a game ;-)
ru: __Суть и задача игры__ - составить вместе с друзьями произвольную историю на определённую тему. И, конечно, получить удовольствие и от процесса и от результата :-) __Правила игры:__ - Игроки ходят по очереди. Каждый игрок в свой ход тянет карту из одной из трёх колод на выбор и рассказывает свою часть истории, руководствуясь той картой, которая ему выпала. - Во время хода игрока никто не имеет права его поправлять или перебивать, он полностью свободен в трактовке смысла карты и составлении своей части истории, хотя и должен опираться на здравый смысл, рассказанный ранее сюжет и общие договорённости. - Перед началом игры рекомендуется совместно решить, к какому жанру, стилю и вселенной будет относиться повествование. __Виды карт.__ Карты в игре есть трёх типов: - Место - предполагает, что действие сюжета должно быть перенесено в указанное на карте место (в прямом или переносном смысле) - Персонаж - вытянувший эту карту игрок должен ввести в повествование персонажа (в прямом или переносном смысле), указанного на карте. - Общая - эти карты задают тему для всех остальных событий/явлений, которые должны произойти в игровом мире в ход вытянувшего их игрока. НО не относитесь к этому чересчур серьёзно! Помните - это всего лишь игра ;-)

# docGameScreen
source: Let's start the gameplay itself! Now each player will need to choose a card from one of the three decks on his turn. Then tell your part of the story, focusing on what is indicated on the map. At the end of the story, you need to press the green button in the upper right corner and pass the phone to the next player. The gamemaster starts first, and he will be shown three cards at once on his first turn, from which you need to collect the plot of the story, and then pass the move to the next player.
ru: Начинаем сам игровой процесс! Теперь каждому игроку нужно будет в свой ход выбрать карту из одной из трёх колод. После чего рассказать свою часть истории, ориентируясь на то, что указано на карте. По завершении истории нужно нажать зелёную кнопку в верхнем правом углу и передать телефон следующему игроку. Игромастер начинает первым, и ему в свой первый ход будут показаны сразу три карты, из которых нужно собрать завязку истории, после чего передать ход следующему игроку.

# docTrainingScreen
source: A little warm-up! Now each of the players will be given a random card from the deck, and you will need to tell something about it that is related to the world / topic you are going to play on. This will allow you to warm up your brains a little, recall forgotten facts and "pump up" less prepared comrades for the game. After you tell your associations on the map, swipe it and pass the phone to the next player. To complete the warm-up, press the green button in the upper right corner.
ru: Небольшая разминка! Сейчас каждому из игроков будет выдаваться случайная карта из колоды, и нужно будет по ней рассказать что-то, что связано с миром/темой, на которую вы собираетесь играть. Это позволит немного разогреть мозги, вспомнить забытые факты и "прокачать" менее подготовленных к игре товарищей. После того как расскажете свои ассоциации по карте - смахните её и передайте телефон следующему игроку. Для завершения разминки нажмите зелёную кнопку в правом верхнем углу.
